/*
 * @Description: 版本更新记录数据文件
 * @Author: chenmo
 * @Date: 2019-04-11 10:40:39
 * @Last Modified by: chenmo
 * @Last Modified time: 2019-04-11 14:27:01
 */

export default [
  {
    title: '2019年4月18日 v1.0.4.2',
    content: [
      '小区搜索逻辑变更',
      '代码优化',
    ],
  },
  {
    title: '2019年4月11日 v1.0.4.1',
    content: [
      '完成购买服务逻辑变更',
      '用户登录权限优化',
      '修复在ios系统上底部按钮被遮挡',
    ],
  },
  {
    title: '2019年4月3日 v1.0.3.2',
    content: [
      '增加服务产品购买、支付',
      '完成服务包购买、支付变更',
      '增加服务记录',
      '完成发起服务逻辑变更',
    ],
  },
  {
    title: '2019年3月12日 v1.0.3.1',
    content: [
      '修复引导页面的定位问题',
    ],
  },
  {
    title: '2019年3月11日 v1.0.3.1',
    content: [
      '完成从react到vue重构版本上线',
      '增加购买服务、发起服务等',
      '增加服务订单、详情',
      '完成发起服务逻辑变更',
      '完成房源委托页面变更'
    ],
  },
  {
    title: '2019年2月15日 v1.0.2',
    content: [
      '完成租赁信息逻辑',
      '增加购买服务、发起服务等',
      '增加服务订单、详情',
      '完成发起服务逻辑变更',
    ],
  },
  {
    title: '2019年1月15日 v1.0.1',
    content: [
      '完成登陆、委托、首页等',
      '完成房源详情、房间信息、房源照片页面',
    ],
  }
];
